#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/tradejournalv2/tradejournal/runs/run-a2AJY9j1aNxnA6CL

Waiting for the plan to start...

Terraform v1.14.4
on linux_amd64
Initializing plugins and modules...
data.oci_objectstorage_namespace.ns: Refreshing...
data.oci_core_services.all_oci_services: Refreshing...
data.oci_objectstorage_namespace.ns: Refresh complete after 1s [id=ObjectStorageNamespaceDataSource-2860814437]
data.oci_core_services.all_oci_services: Refresh complete after 1s [id=CoreServicesDataSource-0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_apigateway_deployment.trade_journal_deployment will be created
  + resource "oci_apigateway_deployment" "trade_journal_deployment" {
      + compartment_id    = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + defined_tags      = (known after apply)
      + display_name      = "trade-journal-deployment"
      + endpoint          = (known after apply)
      + freeform_tags     = (known after apply)
      + gateway_id        = (known after apply)
      + id                = (known after apply)
      + lifecycle_details = (known after apply)
      + path_prefix       = "/api/v1"
      + state             = (known after apply)
      + time_created      = (known after apply)
      + time_updated      = (known after apply)

      + specification {
          + logging_policies {
              + access_log {
                  + is_enabled = true
                }
              + execution_log {
                  + is_enabled = true
                  + log_level  = "INFO"
                }
            }
          + request_policies {
              + cors {
                  + allowed_headers              = [
                      + "*",
                    ]
                  + allowed_methods              = [
                      + "GET",
                      + "POST",
                      + "PUT",
                      + "DELETE",
                      + "OPTIONS",
                      + "PATCH",
                    ]
                  + allowed_origins              = [
                      + "*",
                    ]
                  + exposed_headers              = [
                      + "*",
                    ]
                  + is_allow_credentials_enabled = true
                  + max_age_in_seconds           = 3600
                }
            }
          + routes {
              + methods = [
                  + "GET",
                ]
              + path    = "/health"

              + backend {
                  + allowed_post_logout_uris   = (known after apply)
                  + body                       = (known after apply)
                  + connect_timeout_in_seconds = (known after apply)
                  + function_id                = (known after apply)
                  + is_ssl_verify_disabled     = (known after apply)
                  + post_logout_state          = (known after apply)
                  + read_timeout_in_seconds    = (known after apply)
                  + send_timeout_in_seconds    = (known after apply)
                  + status                     = (known after apply)
                  + type                       = "HTTP_BACKEND"
                  + url                        = "https://example.com/health"
                }

              + request_policies {}

              + response_policies {}
            }
        }
    }

  # oci_apigateway_gateway.trade_journal_gateway will be created
  + resource "oci_apigateway_gateway" "trade_journal_gateway" {
      + certificate_id             = (known after apply)
      + compartment_id             = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + defined_tags               = (known after apply)
      + display_name               = "trade-journal-gateway"
      + endpoint_type              = "PUBLIC"
      + freeform_tags              = (known after apply)
      + hostname                   = (known after apply)
      + id                         = (known after apply)
      + ip_addresses               = (known after apply)
      + lifecycle_details          = (known after apply)
      + network_security_group_ids = (known after apply)
      + state                      = (known after apply)
      + subnet_id                  = (known after apply)
      + time_created               = (known after apply)
      + time_updated               = (known after apply)
    }

  # oci_core_internet_gateway.trade_journal_igw will be created
  + resource "oci_core_internet_gateway" "trade_journal_igw" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + defined_tags   = (known after apply)
      + display_name   = "trade-journal-igw"
      + enabled        = true
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_nat_gateway.trade_journal_nat will be created
  + resource "oci_core_nat_gateway" "trade_journal_nat" {
      + block_traffic  = (known after apply)
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + defined_tags   = (known after apply)
      + display_name   = "trade-journal-nat"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + nat_ip         = (known after apply)
      + public_ip_id   = (known after apply)
      + route_table_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_route_table.private_route_table will be created
  + resource "oci_core_route_table" "private_route_table" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + defined_tags   = (known after apply)
      + display_name   = "trade-journal-private-rt"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = (known after apply)
          + destination       = "0.0.0.0/0"
          + destination_type  = "CIDR_BLOCK"
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
      + route_rules {
          + cidr_block        = (known after apply)
          + description       = (known after apply)
          + destination       = "all-sjc-services-in-oracle-services-network"
          + destination_type  = "SERVICE_CIDR_BLOCK"
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
    }

  # oci_core_route_table.public_route_table will be created
  + resource "oci_core_route_table" "public_route_table" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + defined_tags   = (known after apply)
      + display_name   = "trade-journal-public-rt"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = (known after apply)
          + destination       = "0.0.0.0/0"
          + destination_type  = "CIDR_BLOCK"
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
    }

  # oci_core_security_list.functions_security_list will be created
  + resource "oci_core_security_list" "functions_security_list" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + defined_tags   = (known after apply)
      + display_name   = "trade-journal-functions-sl"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + egress_security_rules {
          + description      = (known after apply)
          + destination      = "0.0.0.0/0"
          + destination_type = "CIDR_BLOCK"
          + protocol         = "all"
          + stateless        = false
        }

      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "all"
          + source      = "10.0.0.0/16"
          + source_type = "CIDR_BLOCK"
          + stateless   = false
        }
    }

  # oci_core_security_list.public_security_list will be created
  + resource "oci_core_security_list" "public_security_list" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + defined_tags   = (known after apply)
      + display_name   = "trade-journal-public-sl"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + egress_security_rules {
          + description      = (known after apply)
          + destination      = "0.0.0.0/0"
          + destination_type = "CIDR_BLOCK"
          + protocol         = "all"
          + stateless        = false
        }

      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + tcp_options {
              + max = 443
              + min = 443
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + tcp_options {
              + max = 80
              + min = 80
            }
        }
    }

  # oci_core_service_gateway.trade_journal_sg will be created
  + resource "oci_core_service_gateway" "trade_journal_sg" {
      + block_traffic  = (known after apply)
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + defined_tags   = (known after apply)
      + display_name   = "trade-journal-sg"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + services {
          + service_id   = "ocid1.service.oc1.us-sanjose-1.aaaaaaaa7w72lnqlnse4zc5vubcjv6mhsooz3jlaazcbzq7hnzih26qqiw6a"
          + service_name = (known after apply)
        }
    }

  # oci_core_subnet.functions_subnet will be created
  + resource "oci_core_subnet" "functions_subnet" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.0.2.0/24"
      + compartment_id             = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "trade-journal-functions-subnet"
      + dns_label                  = "functions"
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = true
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # oci_core_subnet.public_subnet will be created
  + resource "oci_core_subnet" "public_subnet" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.0.1.0/24"
      + compartment_id             = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "trade-journal-public-subnet"
      + dns_label                  = "public"
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = false
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # oci_core_vcn.trade_journal_vcn will be created
  + resource "oci_core_vcn" "trade_journal_vcn" {
      + byoipv6cidr_blocks               = (known after apply)
      + cidr_block                       = (known after apply)
      + cidr_blocks                      = [
          + "10.0.0.0/16",
        ]
      + compartment_id                   = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + default_dhcp_options_id          = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_list_id         = (known after apply)
      + defined_tags                     = (known after apply)
      + display_name                     = "trade-journal-vcn"
      + dns_label                        = "tradejournal"
      + freeform_tags                    = (known after apply)
      + id                               = (known after apply)
      + ipv6cidr_blocks                  = (known after apply)
      + ipv6private_cidr_blocks          = (known after apply)
      + is_ipv6enabled                   = (known after apply)
      + is_oracle_gua_allocation_enabled = (known after apply)
      + state                            = (known after apply)
      + time_created                     = (known after apply)
      + vcn_domain_name                  = (known after apply)
    }

  # oci_database_autonomous_database.trade_journal_db will be created
  + resource "oci_database_autonomous_database" "trade_journal_db" {
      + actual_used_data_storage_size_in_tbs           = (known after apply)
      + admin_password                                 = (sensitive value)
      + allocated_storage_size_in_tbs                  = (known after apply)
      + apex_details                                   = (known after apply)
      + are_primary_whitelisted_ips_used               = (known after apply)
      + auto_refresh_frequency_in_seconds              = (known after apply)
      + auto_refresh_point_lag_in_seconds              = (known after apply)
      + autonomous_container_database_id               = (known after apply)
      + autonomous_database_backup_id                  = (known after apply)
      + autonomous_database_id                         = (known after apply)
      + autonomous_maintenance_schedule_type           = (known after apply)
      + available_upgrade_versions                     = (known after apply)
      + backup_config                                  = (known after apply)
      + backup_retention_period_in_days                = (known after apply)
      + character_set                                  = (known after apply)
      + clone_type                                     = (known after apply)
      + compartment_id                                 = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + compute_count                                  = (known after apply)
      + compute_model                                  = (known after apply)
      + connection_strings                             = (known after apply)
      + connection_urls                                = (known after apply)
      + cpu_core_count                                 = 1
      + data_safe_status                               = (known after apply)
      + data_storage_size_in_gb                        = (known after apply)
      + data_storage_size_in_tbs                       = 1
      + database_edition                               = (known after apply)
      + database_management_status                     = (known after apply)
      + dataguard_region_type                          = (known after apply)
      + db_name                                        = "TRADEJRNL"
      + db_version                                     = (known after apply)
      + db_workload                                    = "OLTP"
      + defined_tags                                   = (known after apply)
      + disaster_recovery_region_type                  = (known after apply)
      + disaster_recovery_type                         = (known after apply)
      + display_name                                   = "trade-journal-db"
      + failed_data_recovery_in_seconds                = (known after apply)
      + freeform_tags                                  = (known after apply)
      + id                                             = (known after apply)
      + in_memory_area_in_gbs                          = (known after apply)
      + in_memory_percentage                           = (known after apply)
      + infrastructure_type                            = (known after apply)
      + is_access_control_enabled                      = (known after apply)
      + is_auto_scaling_enabled                        = true
      + is_auto_scaling_for_storage_enabled            = true
      + is_data_guard_enabled                          = (known after apply)
      + is_dedicated                                   = (known after apply)
      + is_dev_tier                                    = (known after apply)
      + is_free_tier                                   = (known after apply)
      + is_local_data_guard_enabled                    = (known after apply)
      + is_mtls_connection_required                    = false
      + is_preview                                     = (known after apply)
      + is_preview_version_with_service_terms_accepted = (known after apply)
      + is_reconnect_clone_enabled                     = (known after apply)
      + is_refreshable_clone                           = (known after apply)
      + is_remote_data_guard_enabled                   = (known after apply)
      + is_replicate_automatic_backups                 = (known after apply)
      + key_history_entry                              = (known after apply)
      + key_store_id                                   = (known after apply)
      + key_store_wallet_name                          = (known after apply)
      + kms_key_id                                     = (known after apply)
      + kms_key_lifecycle_details                      = (known after apply)
      + kms_key_version_id                             = (known after apply)
      + license_model                                  = "LICENSE_INCLUDED"
      + lifecycle_details                              = (known after apply)
      + local_adg_auto_failover_max_data_loss_limit    = (known after apply)
      + local_disaster_recovery_type                   = (known after apply)
      + local_standby_db                               = (known after apply)
      + max_cpu_core_count                             = (known after apply)
      + memory_per_oracle_compute_unit_in_gbs          = (known after apply)
      + ncharacter_set                                 = (known after apply)
      + net_services_architecture                      = (known after apply)
      + next_long_term_backup_time_stamp               = (known after apply)
      + nsg_ids                                        = (known after apply)
      + ocpu_count                                     = (known after apply)
      + open_mode                                      = (known after apply)
      + operations_insights_status                     = (known after apply)
      + peer_db_ids                                    = (known after apply)
      + permission_level                               = (known after apply)
      + private_endpoint                               = (known after apply)
      + private_endpoint_ip                            = (known after apply)
      + private_endpoint_label                         = (known after apply)
      + provisionable_cpus                             = (known after apply)
      + public_connection_urls                         = (known after apply)
      + public_endpoint                                = (known after apply)
      + refreshable_mode                               = (known after apply)
      + refreshable_status                             = (known after apply)
      + remote_disaster_recovery_configuration         = (known after apply)
      + remote_disaster_recovery_type                  = (known after apply)
      + resource_pool_leader_id                        = (known after apply)
      + role                                           = (known after apply)
      + secret_id                                      = (known after apply)
      + secret_version_number                          = (known after apply)
      + service_console_url                            = (known after apply)
      + shrink_adb_trigger                             = (known after apply)
      + source                                         = (known after apply)
      + source_id                                      = (known after apply)
      + standby_db                                     = (known after apply)
      + standby_whitelisted_ips                        = (known after apply)
      + state                                          = (known after apply)
      + subnet_id                                      = (known after apply)
      + supported_regions_to_clone_to                  = (known after apply)
      + system_tags                                    = (known after apply)
      + time_created                                   = (known after apply)
      + time_data_guard_role_changed                   = (known after apply)
      + time_deletion_of_free_autonomous_database      = (known after apply)
      + time_disaster_recovery_role_changed            = (known after apply)
      + time_local_data_guard_enabled                  = (known after apply)
      + time_maintenance_begin                         = (known after apply)
      + time_maintenance_end                           = (known after apply)
      + time_of_auto_refresh_start                     = (known after apply)
      + time_of_joining_resource_pool                  = (known after apply)
      + time_of_last_failover                          = (known after apply)
      + time_of_last_refresh                           = (known after apply)
      + time_of_last_refresh_point                     = (known after apply)
      + time_of_last_switchover                        = (known after apply)
      + time_of_next_refresh                           = (known after apply)
      + time_reclamation_of_free_autonomous_database   = (known after apply)
      + time_until_reconnect_clone_enabled             = (known after apply)
      + timestamp                                      = (known after apply)
      + total_backup_storage_size_in_gbs               = (known after apply)
      + use_latest_available_backup_time_stamp         = (known after apply)
      + used_data_storage_size_in_gbs                  = (known after apply)
      + used_data_storage_size_in_tbs                  = (known after apply)
      + vault_id                                       = (known after apply)
    }

  # oci_functions_application.trade_journal_app will be created
  + resource "oci_functions_application" "trade_journal_app" {
      + compartment_id             = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + config                     = (known after apply)
      + defined_tags               = (known after apply)
      + display_name               = "trade-journal"
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + network_security_group_ids = (known after apply)
      + shape                      = (known after apply)
      + state                      = (known after apply)
      + subnet_ids                 = (known after apply)
      + syslog_url                 = (known after apply)
      + time_created               = (known after apply)
      + time_updated               = (known after apply)

      + trace_config {
          + domain_id  = (known after apply)
          + is_enabled = true
        }
    }

  # oci_identity_dynamic_group.functions_dynamic_group will be created
  + resource "oci_identity_dynamic_group" "functions_dynamic_group" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaaoe2titp5eb46nexp2rozoath6jd3w6cbwt4rxkymggjc5tuf5kaq"
      + defined_tags   = (known after apply)
      + description    = "Dynamic group for trade-journal functions"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + matching_rule  = "ALL {resource.type = 'fnfunc', resource.compartment.id = 'ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa'}"
      + name           = "trade-journal-functions-dg"
      + state          = (known after apply)
      + time_created   = (known after apply)
    }

  # oci_identity_policy.functions_database_policy will be created
  + resource "oci_identity_policy" "functions_database_policy" {
      + ETag           = (known after apply)
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + defined_tags   = (known after apply)
      + description    = "Allow functions to access Autonomous Database"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + lastUpdateETag = (known after apply)
      + name           = "trade-journal-functions-db-policy"
      + policyHash     = (known after apply)
      + state          = (known after apply)
      + statements     = [
          + "Allow dynamic-group trade-journal-functions-dg to read autonomous-databases in compartment id ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa",
          + "Allow dynamic-group trade-journal-functions-dg to use autonomous-databases in compartment id ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa",
        ]
      + time_created   = (known after apply)
      + version_date   = (known after apply)
    }

  # oci_identity_policy.functions_invoke_policy will be created
  + resource "oci_identity_policy" "functions_invoke_policy" {
      + ETag           = (known after apply)
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + defined_tags   = (known after apply)
      + description    = "Allow functions to invoke other functions"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + lastUpdateETag = (known after apply)
      + name           = "trade-journal-functions-invoke-policy"
      + policyHash     = (known after apply)
      + state          = (known after apply)
      + statements     = [
          + "Allow dynamic-group trade-journal-functions-dg to use fn-function in compartment id ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa",
          + "Allow dynamic-group trade-journal-functions-dg to use fn-invocation in compartment id ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa",
        ]
      + time_created   = (known after apply)
      + version_date   = (known after apply)
    }

  # oci_identity_policy.functions_logging_policy will be created
  + resource "oci_identity_policy" "functions_logging_policy" {
      + ETag           = (known after apply)
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + defined_tags   = (known after apply)
      + description    = "Allow functions to write logs"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + lastUpdateETag = (known after apply)
      + name           = "trade-journal-functions-logging-policy"
      + policyHash     = (known after apply)
      + state          = (known after apply)
      + statements     = [
          + "Allow dynamic-group trade-journal-functions-dg to use log-content in compartment id ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa",
          + "Allow dynamic-group trade-journal-functions-dg to read log-groups in compartment id ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa",
        ]
      + time_created   = (known after apply)
      + version_date   = (known after apply)
    }

  # oci_identity_policy.functions_network_policy will be created
  + resource "oci_identity_policy" "functions_network_policy" {
      + ETag           = (known after apply)
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + defined_tags   = (known after apply)
      + description    = "Allow functions to use VCN resources"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + lastUpdateETag = (known after apply)
      + name           = "trade-journal-functions-network-policy"
      + policyHash     = (known after apply)
      + state          = (known after apply)
      + statements     = [
          + "Allow dynamic-group trade-journal-functions-dg to use virtual-network-family in compartment id ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa",
        ]
      + time_created   = (known after apply)
      + version_date   = (known after apply)
    }

  # oci_identity_policy.functions_object_storage_policy will be created
  + resource "oci_identity_policy" "functions_object_storage_policy" {
      + ETag           = (known after apply)
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + defined_tags   = (known after apply)
      + description    = "Allow functions to access Object Storage"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + lastUpdateETag = (known after apply)
      + name           = "trade-journal-functions-storage-policy"
      + policyHash     = (known after apply)
      + state          = (known after apply)
      + statements     = [
          + "Allow dynamic-group trade-journal-functions-dg to read buckets in compartment id ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa",
          + "Allow dynamic-group trade-journal-functions-dg to manage objects in compartment id ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa",
          + "Allow dynamic-group trade-journal-functions-dg to read objectstorage-namespaces in compartment id ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa",
        ]
      + time_created   = (known after apply)
      + version_date   = (known after apply)
    }

  # oci_identity_policy.functions_secrets_policy will be created
  + resource "oci_identity_policy" "functions_secrets_policy" {
      + ETag           = (known after apply)
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + defined_tags   = (known after apply)
      + description    = "Allow functions to read secrets"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + lastUpdateETag = (known after apply)
      + name           = "trade-journal-functions-secrets-policy"
      + policyHash     = (known after apply)
      + state          = (known after apply)
      + statements     = [
          + "Allow dynamic-group trade-journal-functions-dg to read secret-bundles in compartment id ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa",
        ]
      + time_created   = (known after apply)
      + version_date   = (known after apply)
    }

  # oci_kms_key.trade_journal_key will be created
  + resource "oci_kms_key" "trade_journal_key" {
      + compartment_id                 = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + current_key_version            = (known after apply)
      + defined_tags                   = (known after apply)
      + desired_state                  = (known after apply)
      + display_name                   = "trade-journal-key"
      + external_key_reference_details = (known after apply)
      + freeform_tags                  = (known after apply)
      + id                             = (known after apply)
      + is_auto_rotation_enabled       = (known after apply)
      + is_primary                     = (known after apply)
      + management_endpoint            = (known after apply)
      + protection_mode                = (known after apply)
      + replica_details                = (known after apply)
      + restored_from_key_id           = (known after apply)
      + state                          = (known after apply)
      + time_created                   = (known after apply)
      + time_of_deletion               = (known after apply)
      + vault_id                       = (known after apply)

      + key_shape {
          + algorithm = "AES"
          + curve_id  = (known after apply)
          + length    = 32
        }
    }

  # oci_kms_vault.trade_journal_vault will be created
  + resource "oci_kms_vault" "trade_journal_vault" {
      + compartment_id                        = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + crypto_endpoint                       = (known after apply)
      + defined_tags                          = (known after apply)
      + display_name                          = "trade-journal-vault"
      + external_key_manager_metadata_summary = (known after apply)
      + freeform_tags                         = (known after apply)
      + id                                    = (known after apply)
      + is_primary                            = (known after apply)
      + management_endpoint                   = (known after apply)
      + replica_details                       = (known after apply)
      + restored_from_vault_id                = (known after apply)
      + state                                 = (known after apply)
      + time_created                          = (known after apply)
      + time_of_deletion                      = (known after apply)
      + vault_type                            = "DEFAULT"
    }

  # oci_objectstorage_bucket.reports_storage will be created
  + resource "oci_objectstorage_bucket" "reports_storage" {
      + access_type                  = "NoPublicAccess"
      + approximate_count            = (known after apply)
      + approximate_size             = (known after apply)
      + auto_tiering                 = "InfrequentAccess"
      + bucket_id                    = (known after apply)
      + compartment_id               = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + created_by                   = (known after apply)
      + defined_tags                 = (known after apply)
      + etag                         = (known after apply)
      + freeform_tags                = (known after apply)
      + id                           = (known after apply)
      + is_read_only                 = (known after apply)
      + kms_key_id                   = (known after apply)
      + name                         = "trade-journal-reports"
      + namespace                    = "axtahv0mhabt"
      + object_events_enabled        = (known after apply)
      + object_lifecycle_policy_etag = (known after apply)
      + replication_enabled          = (known after apply)
      + storage_tier                 = "Standard"
      + time_created                 = (known after apply)
      + versioning                   = "Enabled"
    }

  # oci_objectstorage_bucket.trade_journal_storage will be created
  + resource "oci_objectstorage_bucket" "trade_journal_storage" {
      + access_type                  = "NoPublicAccess"
      + approximate_count            = (known after apply)
      + approximate_size             = (known after apply)
      + auto_tiering                 = "InfrequentAccess"
      + bucket_id                    = (known after apply)
      + compartment_id               = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + created_by                   = (known after apply)
      + defined_tags                 = (known after apply)
      + etag                         = (known after apply)
      + freeform_tags                = (known after apply)
      + id                           = (known after apply)
      + is_read_only                 = (known after apply)
      + kms_key_id                   = (known after apply)
      + name                         = "trade-journal-storage"
      + namespace                    = "axtahv0mhabt"
      + object_events_enabled        = (known after apply)
      + object_lifecycle_policy_etag = (known after apply)
      + replication_enabled          = (known after apply)
      + storage_tier                 = "Standard"
      + time_created                 = (known after apply)
      + versioning                   = "Enabled"
    }

  # oci_vault_secret.app_secret will be created
  + resource "oci_vault_secret" "app_secret" {
      + compartment_id                 = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + current_version_number         = (known after apply)
      + defined_tags                   = (known after apply)
      + description                    = "Application secret for trade-journal"
      + freeform_tags                  = (known after apply)
      + id                             = (known after apply)
      + key_id                         = (known after apply)
      + last_rotation_time             = (known after apply)
      + lifecycle_details              = (known after apply)
      + metadata                       = (known after apply)
      + next_rotation_time             = (known after apply)
      + rotation_status                = (known after apply)
      + secret_name                    = "trade-journal-app-secret"
      + state                          = (known after apply)
      + time_created                   = (known after apply)
      + time_of_current_version_expiry = (known after apply)
      + time_of_deletion               = (known after apply)
      + vault_id                       = (known after apply)

      + secret_content {
          + content      = (sensitive value)
          + content_type = "BASE64"
          + stage        = (known after apply)
        }
    }

  # oci_vault_secret.db_admin_password will be created
  + resource "oci_vault_secret" "db_admin_password" {
      + compartment_id                 = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + current_version_number         = (known after apply)
      + defined_tags                   = (known after apply)
      + description                    = "Database admin password for trade-journal"
      + freeform_tags                  = (known after apply)
      + id                             = (known after apply)
      + key_id                         = (known after apply)
      + last_rotation_time             = (known after apply)
      + lifecycle_details              = (known after apply)
      + metadata                       = (known after apply)
      + next_rotation_time             = (known after apply)
      + rotation_status                = (known after apply)
      + secret_name                    = "trade-journal-db-admin-password"
      + state                          = (known after apply)
      + time_created                   = (known after apply)
      + time_of_current_version_expiry = (known after apply)
      + time_of_deletion               = (known after apply)
      + vault_id                       = (known after apply)

      + secret_content {
          + content      = (sensitive value)
          + content_type = "BASE64"
          + stage        = (known after apply)
        }
    }

  # oci_vault_secret.db_wallet_password will be created
  + resource "oci_vault_secret" "db_wallet_password" {
      + compartment_id                 = "ocid1.compartment.oc1..aaaaaaaameyhu7sgwehn47flwdws5ayf4exg34uxut4ajthf6haqwogstzwa"
      + current_version_number         = (known after apply)
      + defined_tags                   = (known after apply)
      + description                    = "Database wallet password for trade-journal"
      + freeform_tags                  = (known after apply)
      + id                             = (known after apply)
      + key_id                         = (known after apply)
      + last_rotation_time             = (known after apply)
      + lifecycle_details              = (known after apply)
      + metadata                       = (known after apply)
      + next_rotation_time             = (known after apply)
      + rotation_status                = (known after apply)
      + secret_name                    = "trade-journal-db-wallet-password"
      + state                          = (known after apply)
      + time_created                   = (known after apply)
      + time_of_current_version_expiry = (known after apply)
      + time_of_deletion               = (known after apply)
      + vault_id                       = (known after apply)

      + secret_content {
          + content      = (sensitive value)
          + content_type = "BASE64"
          + stage        = (known after apply)
        }
    }

  # random_password.app_secret will be created
  + resource "random_password" "app_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 29 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_deployment_endpoint    = (known after apply)
  + api_gateway_endpoint       = (known after apply)
  + api_gateway_hostname       = (known after apply)
  + api_gateway_id             = (known after apply)
  + app_secret_id              = (known after apply)
  + autonomous_database_id     = (known after apply)
  + database_connection_string = (sensitive value)
  + database_name              = "TRADEJRNL"
  + db_password_secret_id      = (known after apply)
  + deployment_summary         = {
      + api_endpoint          = (known after apply)
      + authentication_method = "Resource Principal (OCI_RESOURCE_PRINCIPAL_VERSION=2.2)"
      + database              = "TRADEJRNL"
      + dynamic_group         = "trade-journal-functions-dg"
      + functions_app         = "trade-journal"
      + secrets_in_vault      = "db-admin-password, app-secret"
      + storage_namespace     = "axtahv0mhabt"
    }
  + dynamic_group_id           = (known after apply)
  + dynamic_group_name         = "trade-journal-functions-dg"
  + functions_application_id   = (known after apply)
  + functions_application_name = "trade-journal"
  + functions_subnet_id        = (known after apply)
  + object_storage_namespace   = "axtahv0mhabt"
  + public_subnet_id           = (known after apply)
  + reports_bucket_name        = "trade-journal-reports"
  + storage_bucket_name        = "trade-journal-storage"
  + vault_crypto_endpoint      = (known after apply)
  + vault_id                   = (known after apply)
  + vault_management_endpoint  = (known after apply)
  + vcn_id                     = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Maddy1993, Action: `pull_request`, Workflow: `Deploy OCI Infrastructure`*